In [4]:
import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

In [6]:
#This function is called when random function is initializes

np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])   #Press Shift+Tab to know the parameters
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
df['W']    #OR df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [9]:
#Selecting Columns

df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [10]:
df['new'] = df['W'] + df['X']   #Prior declaration of 'new' column is not required.
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [11]:
#Drop Column  (axis =1)
df.drop('new',axis=1,inplace=True)  #In this axis is always set to one (axis =1)
df                                  #IMP :"inplace = True" is set to make the drop operation permanent.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
#Drop Row   (axis =0)

df.drop('E',axis =0,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [13]:
#Selecting Rows

df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [14]:
df.iloc[2] #Gives the elements corrosponding to C (row) i.e. selection by INDEX

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [15]:
df.loc['B','Y']

-0.8480769834036315

In [16]:
df.loc[['A','C'],['W','Z']]  #Gives random combinations from the over all existing table

          W         Z
A  2.706850  0.503826
C -2.018168 -0.589001

In [17]:
df>0 #Gives values greater than 0 in the data frame

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [18]:
df[df>0]  #This gives nul for numbers less than 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [21]:
df[df['W']>0]   #df['W'] >0 was not true for 'C' hence this returns values eleminating column C

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [26]:
df[df['Z']<0] #For Z column<0 only for C row

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [31]:
df[(df['W']>1) & (df['Y']>0)]    # '&' is used insted of 'and' because it gets confused when simultaneous multiple and operation is performed.

#Similarly for OR we use '|' and not 'or'

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

In [38]:
#Easy method to create list

newlist= 'CA NY WY OR'.split()
newlist

['CA', 'NY', 'WY', 'OR']

In [40]:
#This adds a new column to the table [NOTE: Elements in list must be equal to number of rows]

df['states'] = newlist
df

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR

In [44]:
 df.set_index('states')  #This makes the states the table index but this is temporary 

#Inorder to make this permanent use 'inplace = True '

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057